In [2]:
person = {
    "first": "Shankar",
    "last": "R",
    "age": 41
}

In [3]:
people = {
    "first": ["Shankar"],
    "last": ["R"],
    "age": [41]
}

In [4]:
people = {
    "first": ["Shankar", "Niru", "Akshara"],
    "last": ["R", "S", "S"],    
    "email": ["Shan@email.com", "NIRU@email.com", "AKSH@email.com"]
}

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

     first last           email
0  Shankar    R  Shan@email.com
1     Niru    S  NIRU@email.com
2  Akshara    S  AKSH@email.com

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [15]:
df.columns = ["first_name", "last_name", "email"]

In [16]:
df

  first_name last_name           email
0    Shankar         R  Shan@email.com
1       Niru         S  NIRU@email.com
2    Akshara         S  AKSH@email.com

In [17]:
df.columns = [x.upper() for x in df.columns]

In [18]:
df

  FIRST_NAME LAST_NAME           EMAIL
0    Shankar         R  Shan@email.com
1       Niru         S  NIRU@email.com
2    Akshara         S  AKSH@email.com

In [21]:
df.columns = df.columns.str.replace(" ", "_")

In [22]:
df

  FIRST_NAME LAST_NAME           EMAIL
0    Shankar         R  Shan@email.com
1       Niru         S  NIRU@email.com
2    Akshara         S  AKSH@email.com

In [23]:
df.columns = [x.lower() for x in df.columns]

In [24]:
df

  first_name last_name           email
0    Shankar         R  Shan@email.com
1       Niru         S  NIRU@email.com
2    Akshara         S  AKSH@email.com

In [26]:
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)
df

     first last           email
0  Shankar    R  Shan@email.com
1     Niru    S  NIRU@email.com
2  Akshara    S  AKSH@email.com

In [27]:
df.loc[2]

first           Akshara
last                  S
email    AKSH@email.com
Name: 2, dtype: object

In [28]:
df.loc[2] = ["Aksh", "Shan", "akshara@email.com"]
df

     first  last              email
0  Shankar     R     Shan@email.com
1     Niru     S     NIRU@email.com
2     Aksh  Shan  akshara@email.com

In [32]:
df.loc[2,["first"]]

first    Aksh
Name: 2, dtype: object

In [33]:
df.loc[2,["first"]] = "Akshara"
df

     first  last              email
0  Shankar     R     Shan@email.com
1     Niru     S     NIRU@email.com
2  Akshara  Shan  akshara@email.com

In [34]:
# using 'at' to access a specific row/column
df.at[2, "last"] = "S"
df

     first last              email
0  Shankar    R     Shan@email.com
1     Niru    S     NIRU@email.com
2  Akshara    S  akshara@email.com

In [35]:
filt = (df["email"] == "akshara@email.com")
df[filt]

     first last              email
2  Akshara    S  akshara@email.com

In [44]:
filt = (df["email"] == "akshara@email.com")
df[filt]["email"] = "akshara@email.com" # this will not update
df

     first last           email
0  Shankar    R  Shan@email.com
1     Niru    S  NIRU@email.com
2     Aksh    S  aksh@email.com

In [47]:
filt = (df["email"] == "aksh@email.com")
df.loc[filt, "last"] = "Shan"
df

     first  last           email
0  Shankar     R  Shan@email.com
1     Niru     S  NIRU@email.com
2     Aksh  Shan  aksh@email.com

In [48]:
df["email"] = df["email"].str.lower()
df

     first  last           email
0  Shankar     R  shan@email.com
1     Niru     S  niru@email.com
2     Aksh  Shan  aksh@email.com

In [ ]:
# 1) apply
# 2) map
# 3) applymap
# 4) replace

In [51]:
# 1) apply - to get some information
df["email"].apply(len)

0    10
1    14
2    14
Name: email, dtype: int64

In [52]:
def update_email(email):
    return email.upper()

In [53]:
df["email"] = df["email"].apply(update_email)
df

     first  last           email
0  Shankar     R      SHAN@EMAIL
1     Niru     S  NIRU@EMAIL.COM
2     Aksh  Shan  AKSH@EMAIL.COM

In [54]:
# update values using "apply" with a lambda function

df["email"] = df["email"].apply(lambda x: x.lower())
df

     first  last           email
0  Shankar     R      shan@email
1     Niru     S  niru@email.com
2     Aksh  Shan  aksh@email.com

In [55]:
# using apply on Series - works on each element in the series, while apply on df - works every series in the df
# cannot use the following as there are columns with both str (name, email) and numeric (age) datatypes
# df.apply(pd.Series.min)
# df.apply(lambda x: x.min())

In [56]:
# 2) applymap is used for every value in a df
# note applymap is not available on series
df.applymap(len)

   first  last  email
0      7     1     10
1      4     1     14
2      4     4     14

In [58]:
df.applymap(str.upper)

     first  last           email
0  SHANKAR     R      SHAN@EMAIL
1     NIRU     S  NIRU@EMAIL.COM
2     AKSH  SHAN  AKSH@EMAIL.COM

In [59]:
# 3) map - works only on series
# used to convert existing values to new values
# however, those that were not converted (like akshara@email.com) get NaN == which is not intended/expected
df["email"].map({"shan@email.com": "shankar@email.com", "niru@email.com": "nirupamaa@email.com"})

0                    NaN
1    nirupamaa@email.com
2                    NaN
Name: email, dtype: object

In [60]:
# 4) replace - will just replace the values and NaN issue in map is not encountered here
df["email"] = df["email"].replace({"shan@email.com": "shankar@email.com", "niru@email.com": "nirupamaa@email.com"})

In [61]:
df

     first  last                email
0  Shankar     R           shan@email
1     Niru     S  nirupamaa@email.com
2     Aksh  Shan       aksh@email.com